# School (all data)

This notebook intends to combine school performance data and infrastructure data. The resulting dataset would contain the following rows. 

- Ano 
- Código_IBGE
- Localização
- Aprovação
- Reprovação
- Abandono
- Matrículas
- Docentes
- Estabelecimentos
- Turmas

In [1]:
import pandas as pd

## School performance dataset

In [2]:
# Load performance dataset
performance_df = pd.read_csv("../../transformed_data/education/school_performance_per_municipality.csv")

In [3]:
# check if there is any instance of NaN in any of the rows
performance_df[performance_df.isna().any(axis=1)]

Empty DataFrame
Columns: [Ano, Código_IBGE, Localização, Aprovação, Reprovação, Abandono]
Index: []

In [4]:
# check if there is any instance of -- in any of the rows
performance_df[performance_df.eq("--").any(axis=1)]

         Ano  Código_IBGE Localização Aprovação Reprovação Abandono
0       2008      1100015       Rural        --         --       --
1       2008      1100023       Rural        --         --       --
2       2008      1100049       Rural        --         --       --
3       2008      1100056       Rural        --         --       --
5       2008      1100072       Rural        --         --       --
...      ...          ...         ...       ...        ...      ...
149750  2022      4310538      Urbana        --         --       --
149779  2022      4311734      Urbana        --         --       --
149906  2022      4316972      Urbana        --         --       --
149936  2022      4318614      Urbana        --         --       --
149947  2022      4319356      Urbana        --         --       --

[47612 rows x 6 columns]

In [5]:
# remove instances of -- 
performance_df = performance_df[performance_df.ne("--").all(axis=1)]
performance_df

         Ano  Código_IBGE Localização Aprovação Reprovação Abandono
4       2008      1100064       Rural      77.7         22      0.3
9       2008      1100114       Rural      72.2       12.8       15
10      2008      1100122       Rural      93.3        2.1      4.6
12      2008      1100148       Rural      85.8        0.9     13.3
15      2008      1100205       Rural      72.1        7.2     20.7
...      ...          ...         ...       ...        ...      ...
150498  2022      5222005      Urbana      99.2        0.8      0.0
150499  2022      5222054      Urbana      99.3        0.7      0.0
150500  2022      5222203      Urbana     100.0        0.0      0.0
150501  2022      5222302      Urbana      90.5        5.2      4.3
150502  2022      5300108      Urbana      85.5        9.8      4.7

[102891 rows x 6 columns]

## School infrastructure data

In [6]:
# Load infrastructure dataset
infrastructure_df = pd.read_csv("../../transformed_data/education/school_infrastructure_per_municipality.csv")

In [7]:
# check if there is any instance of NaN in any of the rows
infrastructure_df[infrastructure_df.isna().any(axis=1)]

,Código_IBGE,Localização,Matrículas,Ano,Docentes,Estabelecimentos,Turmas
123954,5300108,Rural,1758,2012,NaN,10,60
123955,5300108,Urbana,81536,2012,NaN,79,"2,247"

In [8]:
# remove NaN values
infrastructure_df = infrastructure_df.dropna()

In [9]:
infrastructure_df[infrastructure_df.isna().any(axis=1)]

Empty DataFrame
Columns: [Código_IBGE, Localização, Matrículas, Ano, Docentes, Estabelecimentos, Turmas]
Index: []

In [10]:
# check if there is any instance of -- in any of the rows
infrastructure_df[infrastructure_df.eq("--").any(axis=1)]

Empty DataFrame
Columns: [Código_IBGE, Localização, Matrículas, Ano, Docentes, Estabelecimentos, Turmas]
Index: []

## Validate IBGE Code and Year as primary keys

In [11]:
def check_equal_lists(list1, list2):
    return sorted(list1) == sorted(list2)

def is_subset(list1, list2):
    set1 = set(list1)
    set2 = set(list2)
    return set2.issubset(set1)

### IBGE

In [12]:
performance_ibge_code = list(performance_df['Código_IBGE'].unique())

In [13]:
infra_ibge_code = list(infrastructure_df['Código_IBGE'].unique())

In [14]:
check_equal_lists(infra_ibge_code, performance_ibge_code), is_subset(infra_ibge_code, performance_ibge_code)

(False, True)

In [15]:
len(performance_ibge_code), len(infra_ibge_code)

(5564, 5570)

### Year

In [16]:
performance_years = list(performance_df['Ano'].unique())
performance_years.sort()
performance_years

[2008,
 2009,
 2010,
 2011,
 2012,
 2013,
 2014,
 2015,
 2016,
 2017,
 2018,
 2019,
 2020,
 2021,
 2022]

In [17]:
infra_years = list(infrastructure_df['Ano'].unique())
infra_years.sort()
infra_years

[2007,
 2008,
 2009,
 2010,
 2011,
 2012,
 2013,
 2014,
 2015,
 2016,
 2017,
 2018,
 2019,
 2020,
 2021,
 2022]

In [18]:
check_equal_lists(infra_years, performance_years), is_subset(infra_years, performance_years)

(False, True)

In [19]:
len(infra_years),len(performance_years)

(16, 15)

In [20]:
# remove data from infra for year = 2007
infrastructure_df = infrastructure_df[infrastructure_df.Ano != 2007]

In [21]:
# check for Year again
infra_years = list(infrastructure_df['Ano'].unique())
len(performance_years), len(infra_years)

(15, 15)

## Merge the 2 datasets

In [22]:
school_merged_df = pd.merge(performance_df, infrastructure_df, on=['Ano', 'Código_IBGE', 'Localização'])

In [23]:
len(school_merged_df.Código_IBGE.unique())

5564

In [24]:
school_merged_df

,Ano,Código_IBGE,Localização,Aprovação,Reprovação,Abandono,Matrículas,Docentes,Estabelecimentos,Turmas
0,2008,1100064,Rural,77.7,22,0.3,328,30,1,11
1,2008,1100114,Rural,72.2,12.8,15,506,32,3,16
2,2008,1100122,Rural,93.3,2.1,4.6,245,19,2,10
3,2008,1100148,Rural,85.8,0.9,13.3,237,13,8,9
4,2008,1100205,Rural,72.1,7.2,20.7,598,45,4,24
...,...,...,...,...,...,...,...,...,...,...
102884,2022,5222005,Urbana,99.2,0.8,0.0,399,27,2,16
102885,2022,5222054,Urbana,99.3,0.7,0.0,340,22,1,12
102886,2022,5222203,Urbana,100.0,0.0,0.0,222,8,1,8
102887,2022,5222302,Urbana,90.5,5.2,4.3,117,14,1,6
102888,2022,5300108,Urbana,85.5,9.8,4.7,"85,139","3,790",94,"2,635"

In [25]:
# check if there is any instance of NaN in any of the rows
school_merged_df[school_merged_df.isna().any(axis=1)]

Empty DataFrame
Columns: [Ano, Código_IBGE, Localização, Aprovação, Reprovação, Abandono, Matrículas, Docentes, Estabelecimentos, Turmas]
Index: []

In [26]:
# check if there is any instance of -- in any of the rows
school_merged_df[school_merged_df.eq("--").any(axis=1)]

Empty DataFrame
Columns: [Ano, Código_IBGE, Localização, Aprovação, Reprovação, Abandono, Matrículas, Docentes, Estabelecimentos, Turmas]
Index: []

In [29]:
# Write the merged DataFrame to a new CSV file
file_path = "../../transformed_data/education/school_expanded_data_ML.csv"
school_merged_df.to_csv(file_path, index=False)

In [30]:
pd.read_csv("../../transformed_data/education/school_expanded_data_ML.csv").info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102889 entries, 0 to 102888
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Ano               102889 non-null  int64
 1   Código_IBGE       102889 non-null  int64
 2   Localização       102889 non-null  object
 3   Aprovação         102889 non-null  float64
 4   Reprovação        102889 non-null  float64
 5   Abandono          102889 non-null  float64
 6   Matrículas        102889 non-null  object
 7   Docentes          102889 non-null  object
 8   Estabelecimentos  102889 non-null  int64
 9   Turmas            102889 non-null  object
dtypes: float64(3), int64(3), object(4)
memory usage: 7.8+ MB

## Create pivoted version

In [32]:
school_merged_df.columns

Index(['Ano', 'Código_IBGE', 'Localização', 'Aprovação', 'Reprovação',
       'Abandono', 'Matrículas', 'Docentes', 'Estabelecimentos', 'Turmas'],
      dtype='object')

In [33]:
school_merged_df.head()

,Ano,Código_IBGE,Localização,Aprovação,Reprovação,Abandono,Matrículas,Docentes,Estabelecimentos,Turmas
0,2008,1100064,Rural,77.7,22,0.3,328,30,1,11
1,2008,1100114,Rural,72.2,12.8,15,506,32,3,16
2,2008,1100122,Rural,93.3,2.1,4.6,245,19,2,10
3,2008,1100148,Rural,85.8,0.9,13.3,237,13,8,9
4,2008,1100205,Rural,72.1,7.2,20.7,598,45,4,24

In [34]:
# Pivot the dataframe
pivot_df = school_merged_df.pivot(index=['Ano', 'Código_IBGE'], columns='Localização', values=['Aprovação', 'Reprovação', 'Abandono', 'Matrículas', 'Docentes', 'Estabelecimentos', 'Turmas'])

# Flatten the MultiIndex and reset index
pivot_df.columns = [f"{col[0]}_{col[1]}" for col in pivot_df.columns]
pivot_df = pivot_df.reset_index()

pivot_df

,Ano,Código_IBGE,Aprovação_Rural,Aprovação_Urbana,Reprovação_Rural,Reprovação_Urbana,Abandono_Rural,Abandono_Urbana,Matrículas_Rural,Matrículas_Urbana,Docentes_Rural,Docentes_Urbana,Estabelecimentos_Rural,Estabelecimentos_Urbana,Turmas_Rural,Turmas_Urbana
0,2008,1100015,NaN,78.6,NaN,7.2,NaN,14.2,NaN,1088,NaN,80,NaN,2,NaN,45
1,2008,1100023,NaN,70.3,NaN,12.7,NaN,17,NaN,3671,NaN,118,NaN,5,NaN,118
2,2008,1100031,NaN,83.6,NaN,5.6,NaN,10.8,NaN,261,NaN,22,NaN,2,NaN,12
3,2008,1100049,NaN,75.8,NaN,10.5,NaN,13.7,NaN,3833,NaN,187,NaN,9,NaN,111
4,2008,1100056,NaN,83.5,NaN,6.3,NaN,10.2,NaN,709,NaN,36,NaN,2,NaN,27
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
83342,2022,5222005,NaN,99.2,NaN,0.8,NaN,0.0,NaN,399,NaN,27,NaN,2,NaN,16
83343,2022,5222054,NaN,99.3,NaN,0.7,NaN,0.0,NaN,340,NaN,22,NaN,1,NaN,12
83344,2022,5222203,NaN,100.0,NaN,0.0,NaN,0.0,NaN,222,NaN,8,NaN,1,NaN,8
83345,2022,5222302,98.0,90.5,2.0,5.2,0.0,4.3,160,117,6,14,1,1,6,6
83346,2022,5300108,86.0,85.5,10.2,9.8,3.8,4.7,"2,822","85,139",267,"3,790",16,94,122,"2,635"

In [35]:
pivot_df = pivot_df.dropna()

In [36]:
pivot_df

,Ano,Código_IBGE,Aprovação_Rural,Aprovação_Urbana,Reprovação_Rural,Reprovação_Urbana,Abandono_Rural,Abandono_Urbana,Matrículas_Rural,Matrículas_Urbana,Docentes_Rural,Docentes_Urbana,Estabelecimentos_Rural,Estabelecimentos_Urbana,Turmas_Rural,Turmas_Urbana
5,2008,1100064,77.7,85,22,11.4,0.3,3.6,328,781,30,40,1,2,11,24
10,2008,1100114,72.2,71.3,12.8,15.4,15,13.3,506,1884,32,107,3,4,16,68
11,2008,1100122,93.3,70,2.1,16.4,4.6,13.6,245,4087,19,219,2,11,10,145
13,2008,1100148,85.8,64.5,0.9,9.9,13.3,25.6,237,789,13,26,8,1,9,23
16,2008,1100205,72.1,70.8,7.2,19.8,20.7,9.4,598,9974,45,539,4,29,24,336
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
83327,2022,5220702,98.2,95.3,1.8,4.7,0.0,0.0,55,79,3,13,1,1,3,6
83329,2022,5221080,100.0,95.0,0.0,0.0,0.0,5.0,4,144,6,16,1,1,2,7
83339,2022,5221809,84.0,96.4,12.0,3.6,4.0,0.0,371,66,69,9,1,1,13,3
83345,2022,5222302,98.0,90.5,2.0,5.2,0.0,4.3,160,117,6,14,1,1,6,6
83346,2022,5300108,86.0,85.5,10.2,9.8,3.8,4.7,"2,822","85,139",267,"3,790",16,94,122,"2,635"

In [37]:
# Write the merged DataFrame to a new CSV file
file_path = "../../transformed_data/education/school_pivoted_data_ML.csv"
pivot_df.to_csv(file_path, index=False)

In [38]:
pd.read_csv("../../transformed_data/education/school_pivoted_data_ML.csv").info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19542 entries, 0 to 19541
Data columns (total 16 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Ano                      19542 non-null  int64
 1   Código_IBGE              19542 non-null  int64
 2   Aprovação_Rural          19542 non-null  float64
 3   Aprovação_Urbana         19542 non-null  float64
 4   Reprovação_Rural         19542 non-null  float64
 5   Reprovação_Urbana        19542 non-null  float64
 6   Abandono_Rural           19542 non-null  float64
 7   Abandono_Urbana          19542 non-null  float64
 8   Matrículas_Rural         19542 non-null  object
 9   Matrículas_Urbana        19542 non-null  object
 10  Docentes_Rural           19542 non-null  object
 11  Docentes_Urbana          19542 non-null  object
 12  Estabelecimentos_Rural   19542 non-null  int64
 13  Estabelecimentos_Urbana  19542 non-null  int64
 14  Turmas_Rural             19542 non-null  float64
 15  Turmas_Urbana            19542 non-null  object
dtypes: float64(7), int64(4), object(5)
memory usage: 2.4+ MB

## Create seperate versions for Rural and Urban

In [39]:
school_rural = school_merged_df[school_merged_df.Localização == 'Rural']
school_rural.head()

,Ano,Código_IBGE,Localização,Aprovação,Reprovação,Abandono,Matrículas,Docentes,Estabelecimentos,Turmas
0,2008,1100064,Rural,77.7,22,0.3,328,30,1,11
1,2008,1100114,Rural,72.2,12.8,15,506,32,3,16
2,2008,1100122,Rural,93.3,2.1,4.6,245,19,2,10
3,2008,1100148,Rural,85.8,0.9,13.3,237,13,8,9
4,2008,1100205,Rural,72.1,7.2,20.7,598,45,4,24

In [40]:
school_rural = school_rural.drop(columns="Localização")
school_rural

,Ano,Código_IBGE,Aprovação,Reprovação,Abandono,Matrículas,Docentes,Estabelecimentos,Turmas
0,2008,1100064,77.7,22,0.3,328,30,1,11
1,2008,1100114,72.2,12.8,15,506,32,3,16
2,2008,1100122,93.3,2.1,4.6,245,19,2,10
3,2008,1100148,85.8,0.9,13.3,237,13,8,9
4,2008,1100205,72.1,7.2,20.7,598,45,4,24
...,...,...,...,...,...,...,...,...,...
97346,2022,5220702,98.2,1.8,0.0,55,3,1,3
97347,2022,5221080,100.0,0.0,0.0,4,6,1,2
97348,2022,5221809,84.0,12.0,4.0,371,69,1,13
97349,2022,5222302,98.0,2.0,0.0,160,6,1,6
97350,2022,5300108,86.0,10.2,3.8,"2,822",267,16,122

In [41]:
# Write the merged DataFrame to a new CSV file
file_path = "../../transformed_data/education/school_rural_data_ML.csv"
school_rural.to_csv(file_path, index=False)

In [42]:
pd.read_csv("../../transformed_data/education/school_rural_data_ML.csv").info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19851 entries, 0 to 19850
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Ano               19851 non-null  int64
 1   Código_IBGE       19851 non-null  int64
 2   Aprovação         19851 non-null  float64
 3   Reprovação        19851 non-null  float64
 4   Abandono          19851 non-null  float64
 5   Matrículas        19851 non-null  object
 6   Docentes          19851 non-null  object
 7   Estabelecimentos  19851 non-null  int64
 8   Turmas            19851 non-null  float64
dtypes: float64(4), int64(3), object(2)
memory usage: 1.4+ MB

In [43]:
school_urban = school_merged_df[school_merged_df.Localização == 'Urbana']
school_urban

,Ano,Código_IBGE,Localização,Aprovação,Reprovação,Abandono,Matrículas,Docentes,Estabelecimentos,Turmas
1084,2008,1100015,Urbana,78.6,7.2,14.2,1088,80,2,45
1085,2008,1100023,Urbana,70.3,12.7,17,3671,118,5,118
1086,2008,1100031,Urbana,83.6,5.6,10.8,261,22,2,12
1087,2008,1100049,Urbana,75.8,10.5,13.7,3833,187,9,111
1088,2008,1100056,Urbana,83.5,6.3,10.2,709,36,2,27
...,...,...,...,...,...,...,...,...,...,...
102884,2022,5222005,Urbana,99.2,0.8,0.0,399,27,2,16
102885,2022,5222054,Urbana,99.3,0.7,0.0,340,22,1,12
102886,2022,5222203,Urbana,100.0,0.0,0.0,222,8,1,8
102887,2022,5222302,Urbana,90.5,5.2,4.3,117,14,1,6
102888,2022,5300108,Urbana,85.5,9.8,4.7,"85,139","3,790",94,"2,635"

In [44]:
school_urban = school_urban.drop(columns="Localização")
school_urban

,Ano,Código_IBGE,Aprovação,Reprovação,Abandono,Matrículas,Docentes,Estabelecimentos,Turmas
1084,2008,1100015,78.6,7.2,14.2,1088,80,2,45
1085,2008,1100023,70.3,12.7,17,3671,118,5,118
1086,2008,1100031,83.6,5.6,10.8,261,22,2,12
1087,2008,1100049,75.8,10.5,13.7,3833,187,9,111
1088,2008,1100056,83.5,6.3,10.2,709,36,2,27
...,...,...,...,...,...,...,...,...,...
102884,2022,5222005,99.2,0.8,0.0,399,27,2,16
102885,2022,5222054,99.3,0.7,0.0,340,22,1,12
102886,2022,5222203,100.0,0.0,0.0,222,8,1,8
102887,2022,5222302,90.5,5.2,4.3,117,14,1,6
102888,2022,5300108,85.5,9.8,4.7,"85,139","3,790",94,"2,635"

In [45]:
# Write the merged DataFrame to a new CSV file
file_path = "../../transformed_data/education/school_urbana_data_ML.csv"
school_urban.to_csv(file_path, index=False)

In [47]:
pd.read_csv("../../transformed_data/education/school_urbana_data_ML.csv")

,Ano,Código_IBGE,Aprovação,Reprovação,Abandono,Matrículas,Docentes,Estabelecimentos,Turmas
0,2008,1100015,78.6,7.2,14.2,1088,80,2,45
1,2008,1100023,70.3,12.7,17.0,3671,118,5,118
2,2008,1100031,83.6,5.6,10.8,261,22,2,12
3,2008,1100049,75.8,10.5,13.7,3833,187,9,111
4,2008,1100056,83.5,6.3,10.2,709,36,2,27
...,...,...,...,...,...,...,...,...,...
83033,2022,5222005,99.2,0.8,0.0,399,27,2,16
83034,2022,5222054,99.3,0.7,0.0,340,22,1,12
83035,2022,5222203,100.0,0.0,0.0,222,8,1,8
83036,2022,5222302,90.5,5.2,4.3,117,14,1,6
83037,2022,5300108,85.5,9.8,4.7,"85,139","3,790",94,"2,635"